---
kind: method
id: M:Autodesk.Revit.DB.SunAndShadowSettings.FitToModel
source: html/b9de8188-ffe3-407c-102e-850e92977a32.htm
---
# Autodesk.Revit.DB.SunAndShadowSettings.FitToModel Method

Adjust SunAndShadowSettings to fit around the current model geometry.

## Syntax (C#)
```csharp
public void FitToModel()
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - The SunAndShadowSettings is not view-specific.